In [3]:
import pandas as pd
import numpy as np
from scipy.stats import chisquare

In [4]:
draftdf = pd.read_csv('draft_data.csv')

In [5]:
performancedf = pd.read_csv('performance_data.csv')

In [6]:
draftdf.head()

,Unnamed: 0,Round,Pick,Overall,Team,Player,Position,Year,overall_pick,pick_points
0,0,1.0,1.0,2018-1,BUF,Rasmus Dahlin,D,2018,1,216
1,1,1.0,2.0,2018-2,CAR,Andrei Svechnikov,F,2018,2,215
2,2,1.0,3.0,2018-3,MTL,Jesperi Kotkaniemi,F,2018,3,214
3,3,1.0,4.0,2018-4,OTT,Brady Tkachuk,F,2018,4,213
4,4,1.0,5.0,2018-5,ARI,Barrett Hayton,F,2018,5,212

In [7]:
performancedf.head()

   Unnamed: 0  Year Team  GP   W   L  year_diff  wins_change
0         232  2007  ANA  82  48  20        NaN          NaN
1         267  2008  ANA  82  47  27        1.0    -0.020833
2         313  2009  ANA  82  42  33        1.0    -0.106383
3         345  2010  ANA  82  39  32        1.0    -0.071429
4         372  2011  ANA  82  47  30        1.0     0.205128

In [13]:
draftdf['round_mult'] = 8 - draftdf['Round']

In [19]:
draftdf['pick_points'] = draftdf['round_mult'] * (39 - draftdf['Pick'])

In [22]:
performancedf['change_direction'] = 'positive'

In [24]:
mask = performancedf.wins_change < 0
performancedf.loc[mask, 'change_direction'] = 'negative'

In [25]:
performancedf.head()

   Unnamed: 0  Year Team  GP   W   L  year_diff  wins_change change_direction
0         232  2007  ANA  82  48  20        NaN          NaN         positive
1         267  2008  ANA  82  47  27        1.0    -0.020833         negative
2         313  2009  ANA  82  42  33        1.0    -0.106383         negative
3         345  2010  ANA  82  39  32        1.0    -0.071429         negative
4         372  2011  ANA  82  47  30        1.0     0.205128         positive

In [33]:
draftgroup1 = pd.DataFrame({'pick_points':draftdf.groupby(['Year', 'Team', 'Position'])['pick_points'].sum()}).reset_index()
draftgroup1

      Year Team Position  pick_points
0     1970  BOS        D        496.0
1     1970  BOS        F       1173.0
2     1970  BOS        G        312.0
3     1970  BUF        D        532.0
4     1970  BUF        F       1254.0
5     1970  BUF        G         76.0
6     1970  CHI        D        250.0
7     1970  CHI        F        675.0
8     1970  CHI        G        150.0
9     1970  CSE        D        340.0
10    1970  CSE        F       1087.0
11    1970  CSE        G        204.0
12    1970  DET        D        351.0
13    1970  DET        F        972.0
14    1970  LAK        F        854.0
15    1970  LAK        G        216.0
16    1970  MNS        D        990.0
17    1970  MNS        F        828.0
18    1970  MTL        D        476.0
19    1970  MTL        F        521.0
20    1970  MTL        G        700.0
21    1970  NYR        D        224.0
22    1970  NYR        F       1092.0
23    1970  NYR        G         56.0
24    1970  PHI        D        280.0
25    1970  PHI        F       1190.0
26    1970  PIT        D        384.0
27    1970  PIT        F       1184.0
28    1970  STL        D        434.0
29    1970  STL        F        900.0
...    ...  ...      ...          ...
3063  2018  OTT        G        148.0
3064  2018  PHI        D        616.0
3065  2018  PHI        F        435.0
3066  2018  PHI        G        120.0
3067  2018  PIT        D        204.0
3068  2018  PIT        F        416.0
3069  2018  SJS        D        126.0
3070  2018  SJS        F        428.0
3071  2018  SJS        G         72.0
3072  2018  STL        D        350.0
3073  2018  STL        F        348.0
3074  2018  STL        G        200.0
3075  2018  TBL        D        236.0
3076  2018  TBL        F        176.0
3077  2018  TBL        G         88.0
3078  2018  TOR        D        482.0
3079  2018  TOR        F        610.0
3080  2018  TOR        G         32.0
3081  2018  VAN        D        818.0
3082  2018  VAN        F        362.0
3083  2018  VAN        G         66.0
3084  2018  VGK        D        410.0
3085  2018  VGK        F        412.0
3086  2018  VGK        G         34.0
3087  2018  WPG        D        138.0
3088  2018  WPG        F        240.0
3089  2018  WPG        G         40.0
3090  2018  WSH        D        476.0
3091  2018  WSH        F        372.0
3092  2018  WSH        G         64.0

[3093 rows x 4 columns]

In [34]:
draftgroup1['top_drafted'] = draftgroup1['Position']

In [40]:
draftgroup2 = pd.DataFrame({'pick_points':draftgroup1.groupby(['Year', 'Team'])['pick_points'].max()}).reset_index()
draftgroup2.head()

   Year Team  pick_points
0  1970  BOS       1173.0
1  1970  BUF       1254.0
2  1970  CHI        675.0
3  1970  CSE       1087.0
4  1970  DET        972.0

In [43]:
draftgroup1.drop('top_drafted', axis=1, inplace=True)

In [44]:
draftgroup1.head()

   Year Team Position  pick_points
0  1970  BOS        D        496.0
1  1970  BOS        F       1173.0
2  1970  BOS        G        312.0
3  1970  BUF        D        532.0
4  1970  BUF        F       1254.0

In [51]:
topdrafted = draftgroup2.merge(draftgroup1, how='inner', on=['Team', 'Year', 'pick_points'])
topdrafted.head()

   Year Team  pick_points Position
0  1970  BOS       1173.0        F
1  1970  BUF       1254.0        F
2  1970  CHI        675.0        F
3  1970  CSE       1087.0        F
4  1970  DET        972.0        F

In [53]:
perform = performancedf[performancedf['year_diff'] == 1]
perform.head()

   Unnamed: 0  Year Team  GP   W   L  year_diff  wins_change change_direction
1         267  2008  ANA  82  47  27        1.0    -0.020833         negative
2         313  2009  ANA  82  42  33        1.0    -0.106383         negative
3         345  2010  ANA  82  39  32        1.0    -0.071429         negative
4         372  2011  ANA  82  47  30        1.0     0.205128         positive
5         419  2012  ANA  82  34  36        1.0    -0.276596         negative

In [55]:
perform_change = perform[['Year', 'Team', 'change_direction']].reset_index()
perform_change.head()

   index  Year Team change_direction
0      1  2008  ANA         negative
1      2  2009  ANA         negative
2      3  2010  ANA         negative
3      4  2011  ANA         positive
4      5  2012  ANA         negative

In [56]:
perform_change.drop('index', axis=1, inplace=True)

In [58]:
draft_direction = perform_change.merge(topdrafted, on=['Year', 'Team'], how='inner')
draft_direction.drop('pick_points', axis = 1, inplace=True)
draft_direction.head()

   Year Team change_direction Position
0  2008  ANA         negative        F
1  2009  ANA         negative        D
2  2010  ANA         negative        F
3  2011  ANA         positive        F
4  2012  ANA         negative        D

In [66]:
final = draft_direction.groupby(['Position', 'change_direction']).count()
final.drop('C/LW', axis=0, inplace=True)
final.head()

                           Year  Team
Position change_direction
D        negative           103   103
         positive           134   134
F        negative           372   372
         positive           370   370
G        negative             8     8

In [70]:
final['Year'].unstack()

change_direction  negative  positive
Position
D                      103       134
F                      372       370
G                        8         6